lesson5/twitter-caching-system/tests/load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 10
    - duration: 60
      arrivalRate: 20
    - duration: 60
      arrivalRate: 50
scenarios:
  - name: "Get timeline"
    weight: 60
    flow:
      - get:
          url: "/api/users/user{{ $randomInt(1, 3) }}/timeline"
  - name: "Create tweet"
    weight: 20
    flow:
      - post:
          url: "/api/tweets"
          json:
            userId: "user{{ $randomInt(1, 3) }}"
            content: "Load test tweet {{ $randomString() }}"
            mediaUrls: []
  - name: "Get trending"
    weight: 20
    flow:
      - get:
          url: "/api/trending"